sendf.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>报文重发工具</title>
<!-- 2013-06-04 二 13:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<link rel="stylesheet" type="text/css" href="org.css" />
</head>
<body>
<div id="content">
<h1 class="title">报文重发工具</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 说明</a></li>
<li><a href="#sec-2">2. 使用方法</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 说明</h2>
<div class="outline-text-2" id="text-1">
<p>
对于 dbser 这种无状态的程序. 我们在出现bug 时，一般重新将出现bug 的那条协议数据重新发向dbser,就可以重现bug,
因此 <b>报文重发工具</b>  可以快速定位错误
</p>

<p>
程序下载  <a href="./adds/sendf.tar.gz">这里</a>  
</p>

<p>
是一个python 程序，复制到 linux 下运行
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 使用方法</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-sh">$ sendf -h 10.1.1.5 -p 30004  16 00 00 00 C9 00 0C 00 50 10 00 00 00 00 58 C3 00 00 00 00 00 00


^^^^^^^^^^^^^^^^^^^^^^send buf^^^^^^^^^^^^^^^
HEADER:
        protolen:       22
        protoid:        786633
        cmdid:          1050
        result:         0
        userid:         50008
pri:<span style="color: #a0522d;">len</span>[  4]==========================================================================
        18       00 00 00 00                                        ....             
end:==================================================================================


^^^^^^^^^^^^^^^^^^^^^^recv buf^^^^^^^^^^^^^^^
&#23436;&#25972;16&#36827;&#21046;&#25253;&#25991;:12000000C9000C005010EC03000058C30000
HEADER:
        protolen:       18
        protoid:        786633
        cmdid:          1050
        result:         1004
        userid:         50008
pri:<span style="color: #a0522d;">len</span>[  0]==========================================================================
end:==================================================================================
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;">#</span><span style="color: #b22222;">&#35828;&#26126;</span>
$ sendf --help
Usage: sendf -h 10.1.1.5 -p 30004  16 00 00 00 C9 00 0C 00 50 10 00 00 00 00 58 C3 00 00 00 00 00 00 

send buffer to server

Options:
  --version             show program<span style="color: #8b2252;">'s version number and exit</span>
<span style="color: #8b2252;">  -h HOST, --host=HOST  connect host #&#36830;&#25509;&#21040;&#30340;ip</span>
<span style="color: #8b2252;">  -p PORT, --port=PORT  connect port #&#36830;&#25509;&#21040;&#30340;port</span>
<span style="color: #8b2252;">  --help                show help</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</body>
</html>
